Revit 2027 API
CoordinationModelLinkUtils.GetAllPropertiesForReferenceInsideCoordinationModel Method
 Gets all the properties for the provided Coordination Model instance reference.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<CoordinationModelElementProperty> GetAllPropertiesForReferenceInsideCoordinationModel(
	Document document,
	Element coordinationModelInstance,
	Reference reference
)
Public Shared Function GetAllPropertiesForReferenceInsideCoordinationModel (
	document As Document,
	coordinationModelInstance As Element,
	reference As Reference
) As IList(Of CoordinationModelElementProperty)
public:
static IList<CoordinationModelElementProperty^>^ GetAllPropertiesForReferenceInsideCoordinationModel(
	Document^ document,
	Element^ coordinationModelInstance,
	Reference^ reference
)
static member GetAllPropertiesForReferenceInsideCoordinationModel :
        document : Document *
        coordinationModelInstance : Element *
        reference : Reference -> IList<CoordinationModelElementProperty>
Parameters
document Document
 The document.
coordinationModelInstance Element
 The Coordination Model instance element where the provided reference is found.
reference Reference
 The reference to the element inside the provided Coordination Model instance.
Return Value
IList<CoordinationModelElementProperty>
 Returns a list of properties for the provided Coordination Model instance reference.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelInstance was not found in the given document. -or- The provided Reference is not a valid element inside the provided Coordination Model instance. -or- The provided element is not a Autodesk Docs Coordination Model instance.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to validate web services environment. -or- Failed to validate authentication. -or- The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Remarks
 Properties are available only for elements inside a Coordination Model from Autodesk Docs.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace